# Titanic_survival_pred_naive_bayes

In [31]:
import pandas as pd

In [32]:
df=pd.read_csv("D:\\Machine Learning\\ML\\14_naive_bayes\\titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [33]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [34]:
df.Sex=df.Sex.map({'male':1,'female':0})
df.head()

   Pclass  Sex   Age     Fare  Survived
0       3    1  22.0   7.2500         0
1       1    0  38.0  71.2833         1
2       3    0  26.0   7.9250         1
3       1    0  35.0  53.1000         1
4       3    1  35.0   8.0500         0

In [35]:
#alternative method
#dummies = pd.get_dummies(inputs.Sex)
#dummies.head(3)
#inputs = pd.concat([inputs,dummies],axis='columns')
#inputs.head(3)

In [36]:
inputs=df.drop('Survived',axis='columns')
target=df.Survived

In [37]:
#checking any columns has null values or not
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [38]:
inputs.Age=inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass  Sex   Age     Fare
0       3    1  22.0   7.2500
1       1    0  38.0  71.2833
2       3    0  26.0   7.9250
3       1    0  35.0  53.1000
4       3    1  35.0   8.0500

In [39]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(inputs,target,test_size=0.3)

In [40]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

In [41]:
model.fit(X_train,y_train)

GaussianNB()

In [42]:
model.score(X_test,y_test)

0.7723880597014925

# Calculating score using  cross_val_score

In [43]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train,y_train,cv=10)

array([0.80952381, 0.73015873, 0.79365079, 0.79032258, 0.79032258,
       0.75806452, 0.75806452, 0.75806452, 0.77419355, 0.83870968])